{"d":{"success":true,"message":null,"data":[{"session":"Introduction to Go","time":"9:00 AM - 10:15 AM","desc":"A talk on what Go is with a gentle introduction to its usefulness and the language itself. Brief overviews of how to use it and why you should use it compared to other emerging languages and patterns. If you're curious about Go and how it compares to other systems this talk is for you.\r\n\r\nWhat is Go? Overview of the history of Go. Why Go? Introduction to Go semantics and syntax. Introduction to Go concurrency patterns. Overview of a simple web service built in Go for streaming files. Resources for learning more.\r\n\r\n","room":"Dev/Iowa Bootcamp Room - Oakland 1","speaker":{"web":"http://savorywatt.com","location":"Ankeny, Iowa","name":"Ross Hendrickson","bio":"Ross Hendrickson is a Senior Software Engineer working at Webfilings in Ames Iowa. A lifelong hacker he has worked on diverse subjects such as machine learning, natural language processing, and distributed calculation engines. He is also a regular contributor to open source projects such as Octoprint (a 3D printer web control system and Furious (a task queue library for Python).","img":"RossHendrickson.jpg"}},{"session":"Recovering from an Expert Beginner","time":"9:00 AM - 10:15 AM","desc":"This session will be to explore the real life damage an expert beginner can have on an IT department as well as how we fixed the issues. This will be a case study on how to facilitate a department recovery from an expert beginner.\r\n\r\nhttp://www.daedtech.com/how-developers-stop-learning-rise-of-the-expert-beginner\r\n\r\n","room":"Platinum Supplemental Ins - Oakland 2","speaker":{"web":"http://geekswithblogs.net/ZacHarlan","location":"Cedar Rapids, Iowa","name":"Zac Harlan, Keith Dahlby","bio":"Zac Harlan is a software development manager for J&P Cycles which is based in Anamosa, Iowa. J&P Cycles is the world's leading aftermarket retailer for motorcycle parts and accessories and one of Iowa's largest eCommerce sites. Zac believes in Agile development processes and works to focus his and his teams efforts on \"being Agile\" more than \"doing Agile\". As a software professional for well over a decade Zac prides himself on being a \"full stack\" developer having worked in such industries as eCommerce/retail, manufacturing, telecommunications, and health care. Zac carries with him a pragmatic approach to building software and looks to improve processes that will improve the business, both inside and outside of software.","img":"ZacHarlan.jpg"}},{"session":"Introduction to Haskell","time":"9:00 AM - 10:15 AM","desc":"Haskell is a strongly typed functional programming language actively developed by a group of research mathematicians around the world. While the primary purpose of the language is mathematical research, Haskell can be used for a variety of purposes - including web development. Many times, Haskell’s strong type system will prevent errors, bugs, and problems within an application at compile. This presentation will focus on the basics of functional programming with Haskell, including an overview of syntax, expressions, basic theory, definitions for important components - all using the Haskell Platform and it’s package manager - cabal.","room":"VML Room - Oakdale 3","speaker":{"web":null,"location":null,"name":"Nicholas Starke","bio":"Nick Starke is an Iowa based software engineer who focuses on theoretical approaches to information security as well as high performance computing applications. Nick primarily focuses on using open source software and developing open source solutions. He can be reached on twitter at @nstarke.","img":"NicholasStarke.jpg"}},{"session":"JavaScript Level-Up","time":"9:00 AM - 10:15 AM","desc":"If you've been developing for the web any length of time, you've probably written some JavaScript. You know the basics of the language and you can get things done, and applications shipped. But as the proliferation of JavaScript continues into frameworks like UnderscoreJS, KnockoutJS, AngularJS, AnyOtherThingYouCanThinkOfJS, and even to the server (with NodeJS) you may find yourself struggling to understand how to write professional, full-fledged applications using JavaScript. In this session you will LevelUp your JavaScript skills by learning about closures and how they help to modularize your javascript. Prototypal inheritance and how you can extend JavaScript and you will learn about JavaScript design patterns and how they can take your JavaScript skills to the next level!","room":"Oakland 4","speaker":{"web":"http://leebrandt.me","location":"Kansas City, KS","name":"Lee Brandt","bio":"After almost two decades writing software professionally (and a few years unprofessionally before that), Lee Brandt still continues to learn every day. He has led teams in small and large companies and always manages to keep the business needs at the forefront of software development efforts. He speaks internationally about software development, from both a technical and business perspective, and loves to teach others what he learns. Lee writes software in Objective-C, JavaScript and C#... mostly. He is a Microsoft Most Valuable Professional in Visual C#, one of the directors of the Kansas City Developer Conference (KCDC), and serves as the Regional Mentor for .Net user groups in Kansas and Missouri. Lee is a decorated Gulf War veteran, a husband, a proud pet parent and loves to play the drums whenever he gets any spare time.","img":"LeeBrandt.jpeg"}},{"session":"TDD is Dead, Long live TDD","time":"9:00 AM - 10:15 AM","desc":"Recently there has been talk about Test Driven Development (TDD) being dead. A lot of big names in the software community have been involved in discussions on this topic. I agree with some of the arguments on both sides of the discussion. My personal style of TDD has changed significantly over the past few years because of some of the arguments against TDD. I will discuss how my style of TDD has changed and why it has changed. I will also demonstrate my original TDD style as well as my current TDD style so you can see first hand how my approach has changed.","room":"Oakland 5","speaker":{"web":"http://mattjmorrison.com","location":"Grimes, IA","name":"Matthew J Morrison","bio":"Matthew J Morrison is a passionate, professional software developer & hobbyist; Language nerd & regular user of TDD, Unix, Python, Ruby & JavaScript. He also blogs occasionally at mattjmorrison.com and tweets from time to time at @mattjmorrison.","img":"MatthewJMorrison.jpeg"}},{"session":"Demystifying Big Data","time":"9:00 AM - 10:15 AM","desc":"Big Data is here to stay. And with it comes a deluge of new buzz words and acronyms. Phrases like \"NoSQL\", \"Document Database\", \"Velocity, Volume, and Variety\", \"Hadoop\", and \"Map Reduce\" are now commonplace. To make matters worse, depending on who you talk to, the definitions of these phrases are slightly different. Jon will walk through what big data really means and pull back the curtain on all the buzzwords surrounding it. Jon will explain the origins of NoSQL, what the various NoSQL databases are, and when each would be used. Jon walks you through the concept of MapReduce and how this tool will allow manipulation and aggregation of massive amounts of data in your enterprise.\r\nJon will help you understand what all of these various new technologies really are and how they could impact you and your business. Most importantly, Jon will give you the information you need to make informed decisions about when and where these tools should be used in your enterprise.","room":"Borlaug","speaker":{"web":"http://jonathanfmills.com","location":"Liberty","name":"Jonathan Mills","bio":"With over 18 years of experience in Software Development and Management, Jon has led and built agile teams in a wide range of environments from small start-ups to large scale financial institutions. As a skilled mentor and international speaker, Jon has the opportunity to promote positive management practices and personal development skills to developers and managers in many different situations.\r\n\r\nAs a director at PaigeTechnologies, Jon has the opportunity to help hiring managers identify and attract the best possible candidates for their IT needs. Jon is also able to work with potential candidates to teach them the skills necessary in the ever changing technology field.\r\n\r\nJon is able to ask the technical and tough questions of our clients to help drive beyond the initial job description and find a candidate that will be the right fit for the environment. Jon is able to observe trends in the work force in Kansas City and adapt a training program to meet those needs. All this helps PaigeTechnologies build a better workforce for the companies of the region.","img":"JonathanMills.jpg"}},{"session":"Mobile First - From Theory to Execution","time":"9:00 AM - 10:15 AM","desc":"With mobile browsing projected to exceed desktop browsing by the end of 2015, mobile development can no longer be an afterthought. We'll begin with a brief introduction to the landscape of mobile development. Where we've been and where we are heading. We need to then figure out how do we shift to \"mobile first\". What does it mean? How do we shift our thinking?\r\n\r\nLearn how to make the transition from designing for desktops/laptops to designing for mobile. In this session we'll explore a hands on demonstration of developing a mobile-first website utilizing Bootstrap. See how their latest release has made the shift to the mobile first mind set. We'll also have a brief overview in how to transition from 2.x to 3.1.","room":"Clark","speaker":{"web":"http://www.webedgemedia.com","location":"Kansas City, KS","name":"Jon Harding","bio":"Jon has ten years of web development experience in both front-end development and software development. His technologies of choice are MVC, Web API, C#, javascript, HTML5, CSS3, jQuery and Angular. His interest and focus is currently in responsive web development and building single page applications. Jon is a constant learner and enjoys watching tutorials and technical reading.","img":"JonHarding.jpg"}},{"session":"What's Next in C#","time":"10:30 AM - 11:45 AM","desc":"It's a brave new world out there. The new C# compiler (\"Roslyn\") is open source, we can write applications for Andriod, iOS and OSX using C#, cats and dogs living together, mass hysteria! The C# language is one of a developer's best friends, and over the years our friend has grown and matured and become truly epic - from generics to LINQ, lambda expressions to async and await. So what's next? Join me in this session as we explore what's in store for us in project Roslyn, and look at the many new language features in the next version of C#. Spoiler alert: C# v.Next is AWESOME!","room":"Dev/Iowa Bootcamp Room - Oakland 1","speaker":{"web":"http://adambarney.com","location":"Lincoln, NE","name":"Adam Barney","bio":"Adam is a Microsoft MVP (C#) and ASP Insider who runs his own software consulting company, Barney Consulting. While he spends most of his time developing for the web, he also enjoys mobile app development, running technical user groups and code camps, lamenting his lack of time to learn more new stuff, and long walks on the beach. He lives in Lincoln, NE with his wife and two kids.","img":"AdamBArney.png"}},{"session":"X-platform with Xamarin: Have your C# and mobile too","time":"10:30 AM - 11:45 AM","desc":"Let's talk about how you can take your .Net/C# skills and use them to start building mobile applications for iOS, Android, and Windows Phone. Using Xamarin it's still possible to use Visual Studio, Linq, lambdas, and all the other goodies that make a lot of people appreciate the productivity possible with .Net/C#. We'll also talk about ways to organize cross platform mobile solutions, some helpful cross-platform frameworks and libraries, and what some of the drawbacks and \"gotchas\" are.\r\n","room":"Platinum Supplemental Ins - Oakland 2","speaker":{"web":"http://www.motisconsulting.com/","location":"Dubuque, IA","name":"Dennis Welu","bio":"Dennis Welu is the owner and principal consultant of Motis Consulting. Dennis has plenty of experience in software development ranging from hands on engineering to product management to executive leadership. He has been a consultant to clients large and small - from startup to Fortune 100 companies. Motis is focused primarily on mobile software development.\r\n","img":"DennisWelu.jpg"}},{"session":"SQL Server Features That Will Blow Your Mind!","time":"10:30 AM - 11:45 AM","desc":"How many lines of code does it take to generate a running total? How would you find a value in the next row of data - without using a cursor or loop? How can you efficiently store rows of data with a lot of optional fields, and how can you quickly find which of those rows have values? And how can you eliminate locking without resorting to dirty reads? SQL Server has answers for all of these questions, and none requires more than a few lines of code. Give me an hour, and I will blow your mind!","room":"VML Room - Oakdale 3","speaker":{"web":"http://edleightondick.com","location":"Amana, IA","name":"Ed Leighton-Dick","bio":"Ed Leighton-Dick is a DBA with over fourteen years of experience in SQL Server and over twenty years of experience in software development and IT. He is currently Senior Database Administrator for GreatAmerica Financial Services Corporation in Cedar Rapids, Iowa, and the chapter leader of the I-380 PASS SQL Server User Group. Outside of work, Ed is a devoted husband, father of two beautiful girls, and beginning runner.","img":"EdLeightonDick.jpg"}},{"session":"Application Performance & The .NET/ASP.NET Developer","time":"10:30 AM - 11:45 AM","desc":"This action packed session discusses application performance from the eyes of the developer. Looking into tips, tricks, and tools to help developers keep their applications under control in various situations. This joint session for ASP.NET and Non-ASP.NET developers will help to illustrate the differences that application type, user type, and deployment scenarios can have on the performance needs and issues surrounding an application. Third-party tools will be discussed in this session as a method of helping to diagnose and resolve issues.","room":"Oakland 4","speaker":{"web":"http://www.mitchelsellers.com/blogs.aspx","location":"Urbandale, Iowa","name":"Mitchel Sellers","bio":"Mitchel Sellers, Microsoft C# MVP, DNN MVP is the CEO of IowaComputerGurus, Inc a West Des Moines, Iowa based software consulting firm. At IowaComputerGurus Mitchel is responsible for all software architecture and day-to-day operations of the business. With a world-wide client base IowaComputerGurus customers give Mitchel a unique perspective to analyze technology decisions. Mitchel enjoys giving back to the development community and is a regular speaker at technology events, user groups, and code camps across the country.","img":"MitchelSellers.jpg"}},{"session":"Open Space / Fishbowl Discussion","time":"10:30 AM - 11:45 AM","desc":"An open discussion based on topics you provide.","room":"Oakland 5","speaker":{"web":"http://www.iowacodecamp.com","location":null,"name":"Iowa Code Camp","bio":"Presenting sessions hosted by Iowa Code Camp leadership.","img":"ICC_square.jpg"}},{"session":"Mentoring - The Future of Technology Education","time":"10:30 AM - 11:45 AM","desc":"Computer science jobs are growing at a faster rate than any other career path in the United States, yet 9 out of 10 schools don't offer programming classes. Schools that do offer classes struggle to fill those positions with teachers with a background in programming. While there is a push for getting more technology into schools, there will always be struggle with keeping curriculum in sync with current industry needs. In this session we'll explore the gaps in computer science education, look at why mentoring and after-school programs are an excellent solution for this problem, and talk about ways to implement programs in your area.","room":"Borlaug","speaker":{"web":"http://kcwomenintech.org","location":"Kansas City, MO","name":"Jennifer Wadella","bio":"Jennifer Wadella has been writing code since before she realized it was a credible career path. She currently works as a web developer at VML and loves building javascript applications and attending hackathons. She is an active member of the KC tech community and the founder of Kansas City Women in Technology(KCWiT), a non-profit aimed at growing the number of women in technology careers in Kansas City. KCWiT umbrellas several programs including CoderDojoKC, Tech sHeroes, Coding & Cupcakes, and HackEDkc. Jennifer also sits on the Shawnee Mission School District CTE Advisory board, is a committee member of the KC Girls in STEM initiative, and is on the Young Women in STEM Conference planning committee. She doesn't blog, but she can handle 140 characters - @likeOMGitsFEDAY","img":"JenniferWadella.jpg"}},{"session":"Xamarin vs Cordova (AppBuilder)","time":"10:30 AM - 11:45 AM","desc":"Everyone wants to build apps across all platforms quickly. At what cost does it come at? We will discuss the pros and cons of Telerik AppBuilder and Xamarin. What does each of these tools do for you or your company? Want to know which is the solution you should choose? Come to my session to find out. Cross-platform development on iOS, Android, and Windows could be fun if you use the right tool set.","room":"Clark","speaker":{"web":"http://ByteACode.com","location":"Chicago, IL","name":"Min Maung Maung","bio":"Name a new technology that Min isn't interested in. Min has developed on all mobile platforms from latest Windows 8 to Windows Mobile 6.5. Of course that also means that he has had countless smartphones and tablets. Min is often honing his skills by aggressively competing in hackathons dating back to his days at Dominican University. Being technologically agnostic, he does not stop tinkering with mobile platforms like Android, he creates his own personal microcontrollers for robotics projects. When he's not coding, he's building robots. When he's not adding more robots to his robot army, you will see him speaking at conferences such as That Conference and CodeMash. Monday through Friday, you'll find him cranking out .Net code and writing apps in ASP.Net, KendoUI, Knockout.js, Node.js, and other web solutions.","img":"MinMaungMaung.jpg"}},{"session":"Because we can: Internet of Things (beyond mobile development)","time":"12:45 PM - 2:00 PM","desc":"Times are changing and we as developers are now responsible for total user experience thru both the interface as well as interaction with our apps. Further more, a user experience does not end at a web service that is powered by Ruby or ASP.NET MVC, an app that runs on iPhone, android tablet or a touch enabled Windows laptop. What if you can tell your phone to adjust the temperature in your office -- not just once but every time you enter the office? How about saving energy when no one is around? We can expend the user experience beyond the simple screens of mobile phone. \r\n\r\nWhat will we discover? During the course of the talk, we'll run into Arduino, Arduino Shields, Arduino Clones (including the Spark Core), sensors, Servo controls and basic electronics including PWM controls as well as simple usage of Transistors. We will gather data from hardware devices using the internet and remotely access and control the micro controllers from our computer.","room":"Dev/Iowa Bootcamp Room - Oakland 1","speaker":{"web":"http://www.pressffive.com","location":"Northbrook, Illinois","name":"Lwin Maung","bio":"Lwin Maung is a (mobile) developer and an expert on mechatronics with over 8 years of consulting experience. His mobile applications have been featured on technology sites such as engadget, gizmodo, and pocket now. He has also designed and created programmable microcontrollers and robots from the ground up. He is one of the Hero developers for Microsoft generation app program. Lwin has also help create Windows 8 certification exams for Microsoft. He is currently writing certification study guide for ASP.NET MVC for Microsoft. You can find Lwin speaking at conferences such as CodeMash and ThatConference.","img":"ICC_square.jpg"}},{"session":"Good agile, Bad Agile","time":"12:45 PM - 2:00 PM","desc":"There's been a lot of talk recently about Agile software development. As people try to make the transition, they generally find themselves stumbling and maybe even giving up on Agile altogether. In this session we will discuss what Agile is, and what it isn't. Most importantly how to chose the \"flavor\" that is right for your organization, and how to get started.","room":"Platinum Supplemental Ins - Oakland 2","speaker":{"web":"http://leebrandt.me","location":"Kansas City, KS","name":"Lee Brandt","bio":"After almost two decades writing software professionally (and a few years unprofessionally before that), Lee Brandt still continues to learn every day. He has led teams in small and large companies and always manages to keep the business needs at the forefront of software development efforts. He speaks internationally about software development, from both a technical and business perspective, and loves to teach others what he learns. Lee writes software in Objective-C, JavaScript and C#... mostly. He is a Microsoft Most Valuable Professional in Visual C#, one of the directors of the Kansas City Developer Conference (KCDC), and serves as the Regional Mentor for .Net user groups in Kansas and Missouri. Lee is a decorated Gulf War veteran, a husband, a proud pet parent and loves to play the drums whenever he gets any spare time.","img":"LeeBrandt.jpeg"}},{"session":"Moving from SQL Server to MongoDB","time":"12:45 PM - 2:00 PM","desc":"When we began hacking away on Hudl we chose SQL Server as our database. After a few years and solid company growth we realized SQL Server was becoming a bottleneck. Because we run in the cloud, vertically scaling our DB was not a great option. That's when we began to look at NoSQL seriously and specifically MongoDB. We wanted something that was fast, flexible and developer-friendly. In this talk we'll take a look at our schema design choices, our migration process and the performance we've seen with MongoDB.","room":"VML Room - Oakdale 3","speaker":{"web":"http://www.hudl.com","location":"Camarillo, CA","name":"Jon Dokulil","bio":"Jon is the VP of Engineering at Hudl. He's been with Hudl since the early days and has helped grow the company from one customer to over 50,000 today. Jon is passionate about the craft of building great software. His particular interest areas are distributed systems, operations and scaling. Jon also enjoys backpacking and rock climbing.","img":"JonDokulil.jpg"}},{"session":"Intro to Grunt: Stop doing things manually","time":"12:45 PM - 2:00 PM","desc":"Grunt is a Javascript Task Runner. If you've never heard of Grunt then this presentation is for you. Grunt can help you automatically compile Less/Coffeescript, compile templates, aggregate/minify files, and much more . Don't worry though, you don't have to run Grunt every time you want it to do something. I'll show you the Grunt Watch feature, so you can code faster.\r\nSee a sample here:\r\nhttps://github.com/crolek/grunt_intro_example\r\n","room":"Oakland 4","speaker":{"web":"http://chuckrolek.com","location":"West Des Moines, IA","name":"Chuck Rolek","bio":"Front-end/Infrastructure developer at Principal Financial Group. I hate inefficiency so most of my life is built around making the developers around me more efficient (and myself).\r\n\r\nI joke that I'm fueled by silliness and coffee, and that's how I get my work done.","img":"ChuckRolek.jpeg"}},{"session":"Testing the Next Generation","time":"12:45 PM - 2:00 PM","desc":"Testing: the final frontier. These are the voyages of Software Craftsmanship. Its continuing mission: to explore strange new worlds, to seek out new code and new patterns, to boldly go where no one has gone before.\r\n\r\nLooking to take your testing to new worlds? Want to verify your code meetings your user's requirements?\r\n\r\nCome learn about behavior and property testing in .Net.\r\n\r\nWe'll look at how SpecFlow can get everyone on the same page and how to find more edge cases with property testing using FsCheck.","room":"Oakland 5","speaker":{"web":"http://comp-phil.blogspot.com/","location":"Mundelein, IL","name":"Mike Harris","bio":"Mike Harris is a Software Craftsman and life long learner, who is always looking for the best tools for the job.","img":"MikeHarris.jpg"}},{"session":"Breaking down language barriers: How to communicate to the business","time":"12:45 PM - 2:00 PM","desc":"A soft skills track on how technicians, particularly devs, can be more successful in speaking to their business counterparts. We will review tactics to both speaking and how to distill down the tech conversation into key insights that matter to the business.","room":"Borlaug","speaker":{"web":"http://www.vml.com","location":"Overland Park, KS","name":"Melissa Green","bio":"Melissa Green began her career as a technologist nearly 15 years ago in Kansas City. Melissa's focus has been on bettering business through the use of technology. Having spent time in various industries and various sized organizations learning how to identify needs and lead initiatives to implement solutions against those needs she is quick to adapt and learn new industries and their requirements. She is currently a Managing Director of Technology within VML, the leading digital agency globally and for the past six years she has led a team of over twenty technologists within VML leading strategic and digital initiatives for organizations such as SAP, Conoco-Phillips, Honeywell Safety and Avaya. She currently is responsible for technical operation optimizations and management for over 200 technologists while actively participating in client work.\r\n\r\nOutside of the day-to-day she is actively engaged with student groups and universities working to bring digital into the purview of computer sciences and promoting the entrepreneurial spirit through local organizations and user groups.","img":"MelissaGreen.jpg"}},{"session":"Experiences developing a GPS app in HTML5","time":"12:45 PM - 2:00 PM","desc":"Fairfield, IA has a 17 mile loop trail that has been developed over the last 10 years. I volunteered to write an app that would show distances and terrain on the trail plus provide GPS when on the trail. The talk will cover how the interface developed and a comparison of the HTML5 version with native app versions.","room":"Clark","speaker":{"web":"http://www.iowacodecamp.com","location":"Fairfield, IA","name":"Ralph Bunker","bio":"Computer programmer grateful for HTML5","img":"RalphBunker.jpg"}},{"session":"Data Viz 101","time":"2:15 PM - 3:30 PM","desc":"The pixel. One single itsy-bitsy pixel can convey a wealth of information. Throw a million pixels into a matrix and you have a communication medium of unparalleled power, yet you use it to look at funny pictures of kittens. As Dr. Sheldon Cooper would say \"For Shame\". Come to this session and I'll go over the strengths and weaknesses of all the basic chart types and what simple steps you can do to make your data more engaging and easier to understand. The general points of this talk are platform agnostic, but most demos will be done using d3.js.","room":"Dev/Iowa Bootcamp Room - Oakland 1","speaker":{"web":"http://blog.nitriq.com","location":"Des Moines, IA","name":"Jon von Gillern","bio":"Jon is a C# MVP and Consultant from West Des Moines, Iowa. He became interested in code in his junior high programming class when, in a \"delusion of grandeur\", Jon convinced himself he found a pattern to prime numbers using BASIC-A. Although deflated after realizing his theory was quite silly, his passion for writing software flourished and Jon continued on to get a degree in Computer Engineering from Iowa State University. He has been paid to develop everything from Excel Macros to large scale genetic visualizations using WPF. Currently, Jon is the tech lead for two new developer tools - Nitriq Code Analysis and Atomiq Duplicate Code Finder.","img":"jonvongillern.jpg"}},{"session":"Good developers read the classics!","time":"2:15 PM - 3:30 PM","desc":"In this session we will cover three classic software development books. Pragmatic Programming, Clean Code, and Refactoring. These books are filled with good development practices that can help the new and experienced developer.","room":"Platinum Supplemental Ins - Oakland 2","speaker":{"web":"http://myitcareercoach.com/","location":"West Des Moines, IA","name":"Tom Henricksen","bio":"Tom Henricksen is an experience software developer with 15 years of experience. Tom has worked in web development for most of that time. He is also a certified Scrum Master and leader in software development. He also enjoys helping people who are in IT or considering a move to IT with as a career coach.","img":"TomHenricksen.jpg"}},{"session":"Going The Extra Mile with Entity Framework Code First","time":"2:15 PM - 3:30 PM","desc":"Entity Framework Code First is a breeze to get up and running, but are you taking advantage of some of the more advanced features? Are you getting caught up by common pitfalls? In this presentation, we'll review the history of Entity Framework and the status of the project. We'll cover some core functionality concepts and asynchronous queries. Mike will show how to use StructureMap to easily maintain the lifetime of the DataContext. We'll look at how we can leverage the Projection functionality of AutoMapper to easily write optimized queries. Finally, Mike will demonstrate EF Migrations and how you can tie it into your current continuous integration environment. This presentation assumes you have some knowledge of Entity Framework so we'll try to not get caught up in the basics.","room":"VML Room - Oakdale 3","speaker":{"web":"http://colemike.com/","location":"Cedar Falls, IA","name":"Mike Cole","bio":"Mike Cole is a developer currently focusing on .NET working at Far Reach in Cedar Falls. He's been around the proverbial block in the IT profession and has a wide array of experience in many fields. He is an officer of the CVINETA user group and is actively involved in the community. He is incredibly lazy and is always looking for easier and more streamlined ways to solve everyday problems. His passions in life include his family, sarcastic memes, the outdoors, and always having the last word.","img":"MikeCole.png"}},{"session":"A+ Front End Development with Angular and Azure","time":"2:15 PM - 3:30 PM","desc":"Server Side development is expensive and inefficient. In the world of cloud computing you have to pay for every CPU cycle and gig of RAM that you use. Processing pushed off onto the client will save you big time. This is the promise of Angular and Azure. Using these exciting cutting edge technologies allows us to write standards-based web apps that minimize the amount of server resources we use.\r\n\r\nThis talk will cover the basics of AngularJS and Azure Mobile Services. We will touch on the advantages of using REST-ful services as our backend storage and in doing so minimize the cost of running and maintaining a website. This stuff is cutting-edge, cool, and fun.","room":"Oakland 4","speaker":{"web":"http://blog.nebraskacodecamp.com/","location":"Bennet, NE","name":"Ken Versaw","bio":"Hi! My name is Ken Versaw and I am software developer of 10+ years, mostly in the Microsoft stack of technologies. I am a co-founder and organizer of both the Lincoln .Net Users Group and Nebraska Code Camp. I enjoy board games, spending time with my children, and crushing my enemies, real and imagined.","img":"KenVersaw.jpg"}},{"session":"Are You a SOLID Coder?","time":"2:15 PM - 3:30 PM","desc":"This course provides a detailed introduction to the Object Oriented techniques identified by Robert Martin as the SOLID principles of software design. Intended for both novice and intermediary developers, each of the five principles are fully defined and explored. Real-world coding examples are provided for each software tenant to help fully expound upon the design techniques. By the end of the session, developers will be able to identify common code smells while applying SOLID programming practices that ensure clean and maintainable code.","room":"Oakland 5","speaker":{"web":"http://www.iowacodecamp.com","location":"Overland Park, KS","name":"Steve Green","bio":"Steve Green is an architect with over 15 years of experience building large scale enterprise systems. He holds multiple advanced certifications from Microsoft, as well as accreditations for various content management platforms. Steve excels in working with business executives to solve complex technical challenges. In his spare time, Steve enjoys playing tennis and volunteering with high school debate programs.","img":"SteveGreen.png"}},{"session":"$0 to $60,000 A Month In 6 Months - A Lean Startup Case Study on Agile Software Architecture","time":"2:15 PM - 3:30 PM","desc":"Agile Development and Lean Startup are about creating cultures centered around the pursuit of knowledge, embracing \"I Don't Know\" as a perfectly acceptable answer, and an unacceptable solution. The companies that learn the fastest, win. From November 2013 through April 2014 MensStyleLab.com's revenue grew over 80% month over month, reaching over $60K in sales in a single month in April 2014. In this session I'll break down the steps that we took and what we learned along the way. We'll investigate the tools that startups use to measure and drive growth on a shoestring budget, and how these same principles can be applied anywhere to grow lean, with very little wasted time, effort, or resources.","room":"Borlaug","speaker":{"web":"http://stonefinch.com/","location":"Des Moines, Iowa","name":"Aaron Hoffman","bio":"Aaron is the Co-Founder & CEO of StoneFinch, an Agile Development and Data Analytics Consultancy based in Des Moines, Iowa. StoneFinch focuses on building lasting relationships and creating cultures of continuous learning. StoneFinch uses Agile Development, Human-Centered Design, and Data Analytics to help their clients drive growth and make informed business decisions. Aaron is also the Co-Founder and CTO of Men's Style Lab, a concierge menswear clothing company, a Des Moines based startup currently experiencing very rapid growth. He is a leader of the .NET User Group in Des Moines and is an active member of the entrepreneur community.","img":"AaronHoffman.jpg"}},{"session":"Sublime Text Tips & Tricks","time":"2:15 PM - 3:30 PM","desc":"\r\nThe text editor is one of the developer's most-used tools and cross-platform Sublime Text is among the most popular. Learn to make the most of the hours you spend together.\r\n\r\nDiscover shortcuts, plugins and customizations that will maximize your productivity. Sublime Text features such as Git integration, multiple cursors and Emmet extensions will be demonstrated.","room":"Clark","speaker":{"web":"http://www.iowacodecamp.com","location":"Coralville, Iowa","name":"Andrea Flemming","bio":"With past lives as a librarian and community organizer, Andrea Flemming is involved in numerous technology training initiatives including Iowa Tech Chicks, DevIowa Bootcamp, and Wild Blue Fig, working with women business owners and artisans in Botswana. Follow @aflemming and @iowatechchicks","img":"AndreaFlemming.jpg"}},{"session":"Getting to Know ASP.NET v.Next","time":"3:45 PM - 5:00 PM","desc":"The next iteration of Microsoft's web development platform is it's boldest release yet. The CLR has been re-implemented from the ground up with optimization for cloud and mobile computing as top priorities. ASP.NET v.Next will blow your mind, and make you a more efficient and productive web developer - will you be ready? In this session, I'll tell you about the many ways in which ASP.NET v.Next is completely different, while demonstrating how your existing ASP.NET skill set will still serve you as well as it ever has.","room":"Dev/Iowa Bootcamp Room - Oakland 1","speaker":{"web":"http://adambarney.com","location":"Lincoln, NE","name":"Adam Barney","bio":"Adam is a Microsoft MVP (C#) and ASP Insider who runs his own software consulting company, Barney Consulting. While he spends most of his time developing for the web, he also enjoys mobile app development, running technical user groups and code camps, lamenting his lack of time to learn more new stuff, and long walks on the beach. He lives in Lincoln, NE with his wife and two kids.","img":"AdamBArney.png"}},{"session":"Respect the URL","time":"3:45 PM - 5:00 PM","desc":"As web developers we seem to have forgotten how powerful the web is. The url used to give us a unique resource, until we started abusing it by using JavaScript to change the content of the page without changing the url. We will take a quick look at what has happened to the url and how these new JavaScript frameworks are helping us to fix what we as web developers have broken.","room":"Platinum Supplemental Ins - Oakland 2","speaker":{"web":"http://williamsbdev.com","location":"Waukee, IA","name":"Brandon Williams","bio":"Brandon is a full stack developer excited about building software. He is an avid Vim and tmux user who develops applications with CoffeeScript and Python at work.","img":"BrandonWilliams.jpg"}},{"session":"Break Free with Managed Functional Programming: An Introduction to F#","time":"3:45 PM - 5:00 PM","desc":"Originally developed by Microsoft Research, Cambridge, F# is an open-source, functional-first language in the ML family. Despite its lofty position as a first-class Visual Studio language for the past two releases and its cross-platform availability it hasn't seen widespread adoption in the enterprise. In this session we'll take an introductory look at F#, exploring how its constructs and terse syntax allow you to write more stable, maintainable code while keeping you focused on the problem rather than the plumbing.","room":"VML Room - Oakdale 3","speaker":{"web":"http://davefancher.com","location":"Carmel, Indiana","name":"Dave Fancher","bio":"Dave Fancher is a Software Engineer at Performance Assessment Network in Carmel, Indiana and a Microsoft MVP for Visual F#. He has been building software with the .NET Framework since version 1.1. Dave is active within the Indiana software development community as a member of IndySA, a speaker at user groups throughout the state, and a two-time contributor to Indy GiveCamp. When not writing code he enjoys spending time with his family, watching movies, photography, and gaming on on his Xbox 360.","img":"DaveFancher.png"}},{"session":"Writing, Publishing, Consuming Modules in Javascript","time":"3:45 PM - 5:00 PM","desc":"Unsure of the different module formats in javascript or if you should be using modules at all? Curious how you might author a javascript library and share it with others? Or maybe you just want to consume other libraries as you build a javascript frontend and you'd like to see how others are being successful today.\r\n\r\nJoin me for a history lesson about the various module formats available and the tradeoffs that come with choosing each one. I'll also create/publish/consume a library during a live coding session to show how it's done in 2014!","room":"Oakland 4","speaker":{"web":"http://toranbillups.com","location":"Des Moines, IA","name":"Toran Billups","bio":"Toran Billups is a Senior Software Engineer at WebFilings, a software company in Ames, Iowa. When he isn't writing code at the greatest product company in the Midwest, you can find him evangelizing javascript or teaching Python to 5th graders. Toran also organizes the Des Moines JavaScript user group, where he encourages others to embrace their inner front-end engineer.","img":"ToranBillups.jpg"}},{"session":"Domain Driven Design","time":"3:45 PM - 5:00 PM","desc":"This session will be an introduction to Domain Driven Design concepts and practices in software development and how to apply it in projects dealing with complicated domains. Focus of the session will be to help you understand the concepts and start thinking in a DDD way. Samples for this session will be in .Net","room":"Oakland 5","speaker":{"web":"http://www.iowacodecamp.com","location":"Urbandale, Iowa","name":"Benoy John","bio":"Benoy John is a Software Engineering Professional with experience in all phases of product development and design aspects. He continues to help organisations to figure out better ways to deliver value through improving software development practices and improving business process. He works as Technical Mentor/Coach at both the Leadership and Team levels, building the supporting agile adoption framework, providing agile adoption guidance to leadership, and working with the team on the execution of proven practices and techniques that bring agility to the projects. He is actively involved in Agile Coaching, mentoring, training and building high performance professional agile teams. He has great passion in Test Driven Development, Business Driven Development and Domain Driven Design practices in software development and believes in collaboration and team work for success.","img":"BenoyJohn.jpg"}},{"session":"Introduction to UX Personae","time":"3:45 PM - 5:00 PM","desc":"Who uses this thing? It's a question sometimes asked by every developer at some point in their career. Requirements and requests come in but there's no information as to why it's important or how such can even be justified. In this session, James will walk you through the User Experience (UX) practice of Persona creation. He'll explain what they are, why they are important, and how to go about creating such. If you ever wanted to know how to find out who the users are of your product or wanted to learn more about one of the primary exercises of product design, this session is for you.","room":"Borlaug","speaker":{"web":"http://www.jamesreggers.com","location":"Overland Park, KS","name":"James Eggers","bio":"Developer turned UX designer, James has been designing and building websites for the better part of 15 years across a number of different languages and platforms. By focusing more recently on working with clients and teams through various UX practices, James has been able to refine and better understand what makes good websites great. Check him out on github at http://www.github.com/jameseggers1, his blog at http://www.jamesreggers.com, or on Twitter at @JamesEggers.","img":"JamesEggers.jpg"}},{"session":"iOS development primer","time":"3:45 PM - 5:00 PM","desc":"We'll take a look at how to use Xcode 5 to create a simple application, as well as make a user interface with navigation using the Storyboard, Scenes, and Segues. Finally we'll compile the application and run it in the iOS simulator.","room":"Clark","speaker":{"web":"http://www.freerangecoder.com","location":"Cedar Rapids, IA","name":"Kirschen Seah","bio":"Kirschen's background is Computer Sciences with interests in Software Engineering, Human Computer Interaction, and Mac OS X / iPhone OS development. She started programming with BASIC in 1978 on an Apple ][, and has over 30 years of experience in the field. She worked on OPENSTEP (precursor to Mac OS X Cocoa) graphical prototyping applications on joining Rockwell Collins in 1999. Her role as a Principal Systems Engineer in the Advanced Concepts Group lets her interact with fellow engineers in the company, direct projects, as well as run a lab environment for advanced prototyping for aircraft flight decks. Prior to joining Rockwell Collins, she worked at Acuity (formerly iChat) developing interactive user interfaces for live chat customer service agents. She has been awarded several US patents, and has been recognised within the company and outside for contributions to engineering. In her remaining spare time (infinite of course!) she works on her blog, develops Mac OS X, and iPhone OS applications. She's really motivated to share her experience to help fellow software practitioners develop better skills - be that in good design, implementation, or computer science fundamentals.\r\n\r\nWebsite: http://www.freerangecoder.com\r\n\r\nContact: kirschen@freerangecoder.com\r\n\r\nApp.net, Twitter: @kirschen","img":"KirschenSeah.png"}}]}}