{
    "d" : {
        "success" : true,
        "msg" : null,
        "data" : [{
            "session" : "Breakfast",
            "time" : "8:00 AM - 8:40 AM",
            "desc" : "",
            "room" : "Cafeteria/Atrium",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Welcome and announcements",
            "time" : "8:40 AM - 9:00 AM",
            "desc" : "",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Using MVVM Frameworks",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "You're smart.  You've heard that the MVVM pattern is the way to go for WPF and Silverlight applications - maybe you've even rolled your own helper classes for implementing MVVM in your apps.  But now you understand how the pattern works, and you want to simply trust a 3rd party framework to handle the details of MVVM for you.  Luckily, several frameworks exist, and will do this for you - but it isn't always obvious how to get started.  In this session, we'll take a look at a couple of the more popular options and how to get your app off on the right foot with a MVVM framework.",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "http://www.adambarney.com",
                "location" : "Lincoln, NE",
                "name" : "Adam Barney",
                "bio" : "Adam Barney is a lifelong computer nerd living in Lincoln, NE. He bought his first computer in the fourth grade (a Commodore 64), and has been figuring out how to bend these machines to his will ever since. He started programming professionally in 2000, picking up with the .NET Framework 1.1 a couple years later. In 2008, he co-founded and continues to lead the Lincoln .NET Users Group, which now puts on the annual Nebraska code Camp. By day, Adam is a senior consultant with Sogeti USA out of Omaha, NE.",
                "img" : "adam.jpg"
            }
        },
        {
            "session" : "Create Compelling User Experiences Easily with KnockoutJS",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "Ever since JQuery hit the scene JavaScript has been easier and easier to use to create stunning user experiences on the web. But when UIs get complicated and lots of things need to happen simultaneously after a user action has occurred, the JQuery can be quite involved. Steve Sanderson has released a JavaScript framework that can give great user experiences, while taking advantage of a simple application pattern known as MVVM within JavaScript to handle all of the UI updating. I will go through the reasons why KnockoutJS is a must-have tool in every developer's toolkit, and how you can create a compelling user experience easily with KnockoutJS.",
            "room" : "118E",
            "speaker" : {
                "web" : "http://disruptivetheory.com/",
                "location" : "Merriam, KS",
                "name" : "Lee Brandt",
                "bio" : "Lee has been programming professionally for more than a decade and currently works as a Project Lead Consultant with AdventureTech. He speaks regionally about software development practices and has mentored teams on improving their approach to lean software development through achieving technical proficiency. He is a Microsoft Most Valuable Professional, one of the leaders of the Kansas City .Net User Group, and serves as the Regional Mentor for .Net user groups in Kansas and Missouri.",
                "img" : "lee_brandt_90x117.jpg"
            }
        },
        {
            "session" : "The Tasty Flavors of Entity Framework 4.1",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "The shiniest, newest version of Entity Framework 4.1 is a dramatic addition to the world of data-access in the Microsoft stack. This presentation will cover the three tasty flavors that EF 4.1 comes in: Database-first, model-first, and the exciting new code-first.",
            "room" : "119E",
            "speaker" : {
                "web" : "http://www.codebadger.com",
                "location" : "St. Louis, MO",
                "name" : "Brad Tutterow",
                "bio" : "Brad is a Christian, Father, Husband, and .NET Developer. He leads the best looking web development team in the St. Louis metropolitan area at Swank Motion Pictures. He's into ASP.NET MVC3, JavaScript, and Entity Framework.",
                "img" : "Brad-Tutterow-1.jpg"
            }
        },
        {
            "session" : "A Primer to Android Game Development",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "This session will demonstrate what it takes to get an android game up in running with AndEngine. You will learn how to create, render, and move sprites across the screen, interact with your device, and take advantage of androids media player to add some character to your android game.",
            "room" : "121E",
            "speaker" : {
                "web" : "https://github.com/SkylarWatson",
                "location" : "Ankeny, Iowa",
                "name" : "Skylar Watson",
                "bio" : "Skylar is a passionate software developer who's interests expand several platforms. Some of his current personal projects have him playing with solr/lucene, gradle, and android game development.",
                "img" : "skylar.jpg"
            }
        },
        {
            "session" : "Building webapps for the Cloud with Python and Google App Engine",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "Geared toward Python beginners or people wanting to explore Python. It will include good chunks of Python code but explained at a high level, so no previous knowledge is required. The idea is to get people excited so that they go out and learn Python or if they already do, then start building web applications leveraging the power of Google App Engine.",
            "room" : "125E",
            "speaker" : {
                "web" : "",
                "location" : "Kansas City, KS",
                "name" : "Juan Gomez",
                "bio" : "I'm extremely passionate about all things Python and heavily involved on the Python community. I'm the co-founder of PythonKC and a member of the PyCon US Program Committee. By day I work as Lead Systems Architect for a big IT Services company called CSC out of their Overland park offices",
                "img" : "juan-gomez.jpg"
            }
        },
        {
            "session" : "Programming with the .NET Async CTP",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "I'll give you a better talk description later but suffice to say I'd like to present the VS2010 Async CTP, showing what's likely to become part of .NET 5. I'll try to contrast the CTP features with the existing ways of writing async code (callbacks, TPL).",
            "room" : "126E",
            "speaker" : {
                "web" : "http://sergiopereira.com/blog",
                "location" : "Grayslake, IL",
                "name" : "Sergio Pereira",
                "bio" : "Sergio Pereira has been developing software professionally since the mid 90's. After a short period of desktop application development, Sergio changed his focus to web development and never looked back. He's a strong believer in continuous improvement of himself, the processes, and the tools he uses in the software craft. If you don't see Sergio in front of his computer screen, you will probably find him in front of an even bigger screen watching some live sports or a silly movie. You can find out more about Sergio on his blog or by following @sergiopereira on Twitter.",
                "img" : "sergio-profile_90_117.jpg"
            }
        },
        {
            "session" : "OAuth - Open Authentication for your API",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "Describe OAuth 1 and 2 standards, workflows, when to use each, and real world implementation examples of each.",
            "room" : "132E",
            "speaker" : {
                "web" : "",
                "location" : "West Des Moines, IA",
                "name" : "Brandon Weber",
                "bio" : "Software developer at Dwolla. I am mainly a .NET developer who likes to play in Rails. I aspire for world domination. I enjoy reading and tinkering with technology. 6-year Air Force veteran who worked in networking and cryptography. Computer Engineering graduate from Iowa State University with focus on Information Assurance and Network Security. I also enjoy a good rum ham at the beach.",
                "img" : "brandon-weber.jpg"
            }
        },
        {
            "session" : "Designing For Your Peers - Part 1",
            "time" : "9:00 AM - 10:15 AM",
            "desc" : "This half day workshop will have participant design a solution based on the needs of their team and other peers. Attendees will be provided an overview of various design topics and then will be asked to work together to develop a solution based on a given scenario. Throughout the process, attendees will go through exercises in brainstorming, persona and mental model development, user interviews, information architecture, and prototyping. This workshop is available to anyone who wants to join though attendees are expected to stay throughout the duration.",
            "room" : "210E",
            "speaker" : {
                "web" : "http://www.jamesreggers.com",
                "location" : "Overland Park, KS",
                "name" : "James Eggers",
                "bio" : "Web designer, developer, and speaker who is always willing to talk about his experiences over his 10+ year career.  An active speaker, he strives to focus on keeping up with the latest industry news and trends while improving or broadening his skills.  Lately, he's focused on a number of different topics including Testable JavaScript, User Experience design, and HTML5.",
                "img" : "james-eggers.jpg"
            }
        },
        {
            "session" : "Break",
            "time" : "10:15 AM - 10:30 AM",
            "desc" : "",
            "room" : "",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Static Analysis in .NET",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "We all want to have someone else review our code to make sure it's written well. Wouldn't it be even better if we can have that review process done automatically? In this session, you'll see how you can use static analysis tools (like Code Analysis/FxCop) to find all kinds of implementation issues before they show up in a release. You'll also find out how to manage rule sets in Visual Studio, and find out how you can create your own custom rules.",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "http://www.jasonbock.net",
                "location" : "Shakopee, MN",
                "name" : "Jason Bock",
                "bio" : "Jason Bock is a Principal Consultant for Magenic (http://www.magenic.com), a Microsoft MVP (C#), and an INETA (http://www.ineta.org) speaker. He has worked on a number of business applications using a diverse set of substrates and languages such as C#, .NET, and Java. He is the author of \"Applied .NET Attributes\", \"CIL Programming: Under the Hood of .NET\", \".NET Security\", and \"Visual Basic 6 Win32 API Tutorial\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups. He is a leader of the Twin Cities Code Camp (http://www.twincitiescodecamp.com) and runs the Twin Cities Languages User Group (http://www.twincitieslanguagesusergroup.com). Jason holds a Master's degree in Electrical Engineering from Marquette University.",
                "img" : "JasonSmallHeadShot.jpg"
            }
        },
        {
            "session" : "Modular JavaScript",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "We all know how painful it can be getting the script tags just right in your web application. Wouldn't it be nice if you could organize and modularize your code, set up dependencies, and have them pulled in only when needed? You can, and in this session I will show you how with the power of the Asynchronous Module Definition (AMD). No longer will you have to write dependency management scripts on the server; all of your dependencies will be managed right where you need them: in your JavaScript.",
            "room" : "118E",
            "speaker" : {
                "web" : "http://www.reigndropsfall.net",
                "location" : "Cedar Rapids, IA",
                "name" : "Bryan Forbes",
                "bio" : "Bryan Forbes is a Senior Software Engineer at SitePen, Inc where he has worked for 5 years. While there, he has developed web applications and provided JavaScript support for companies like Sun, Cisco, ESRI, and JP Morgan Chase. In addition to this, Bryan has been a Dojo committer for over 5 years, has over 10 years of JavaScript development experience, and over 15 years experience developing websites. He currently maintains the DojoX DataGrid and a synthetic events library, EventD, for unit testing user interaction with web applications.",
                "img" : "bryan.jpg"
            }
        },
        {
            "session" : "Becoming a Data Savant: Correct Data in a Crunch!",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "Pulling data from an imperfect or unfamiliar database can be a scary thing. One incorrect join, one poor assumption or even one missing constraint on a table can affect the results of your data pull dramatically. This session will teach you how to quickly produce correct data with confidence... bringing you one step closer to becoming a Data Savant!",
            "room" : "119E",
            "speaker" : {
                "web" : "http://zacharyharlan.com",
                "location" : "Cedar Rapids, IA",
                "name" : "Zac Harlan",
                "bio" : "Zac Harlan is an accidental SQL DBA/Developer and .NET developer from Seaton, IL. He works at J&P Cycles and blogs about various development related topics with Geeks with Blogs. Zac has spoken at various community events including the first BarCamp in Iowa City as well as CRineta. His talks have been described as \"Amazing!\", \"Fantastic!\", and \"Life Changing!\"... though those comments were all from Zac.",
                "img" : "Harlan_Zachary-101116.jpg"
            }
        },
        {
            "session" : "TBD",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "",
            "room" : "121E",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Setting Up a Rails Development Environment",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "Ask almost any Rails developer what their biggest challenge in getting started with Rails was and chances are they will all roll their eyes and say the same thing: Setting up their development environment.\n\n Although there are many options when it comes to Rails development environments, we will talk about setting up an Ubuntu-based development environment. Specifically a dual booted machine running Windows 7 as its existing OS.\n\nThe following topics will be covered:\n\nHow / Where to get Ubuntu - Creating the install USB drive (Yes, we will use 11.4)\nInstalling Ubuntu as a secondary OS\nInstall & Configure RVM\nInstall RubyMine\nPull down a project from GitHub\nUsing RubyMine and Bundler to manage Gems\nRun the project locally\nCreate a new Heroku project and deploy to it\n\nThis topic will primarily appeal to beginning Rubyists or developers thinking about getting started with Rails. A lot of technologies will be covered at a high level, so come with questions. Also, bring a buddy. If you've talked about Ruby or Rails with someone who's interested in the language / framework, but are too intimidated to jump in blind, bring them along.",
            "room" : "125E",
            "speaker" : {
                "web" : "http://eliasonmedia.com/",
                "location" : "Des Moines, IA",
                "name" : "Levi Rosol",
                "bio" : "In addition to being CTO of Eliason Media, Levi Rosol is a Co-Founder of both Craftly and ScoreYard. Prior to joining Eliason Media Levi was a Senior Software Consultant for QCI for an industry leading chemical company. In addition, Levi has worked for Two Rivers Marketing as a Solutions Architect working with clients such as Ingersoll Rand, ClubCar, JLG, Ruan and The Principal. After spending 10+ years building solutions with Microsoft technologies, he made the leap to the Ruby on Rails world and isn't looking back. Levi also helps organize community groups like StartupWeekendDSM, BarCampDSM, and the Iowa Code Camp.",
                "img" : "levi.jpg"
            }
        },
        {
            "session" : "Micro Controllers 101 - Introduction to Hardware integration",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "Micro controllers are everywhere in our lives. Learn how to integrate them in your projects around your home or office. Make your life more efficient. We will teach you how to get started with Arduino and Netduino boards. We will demo a few daily examples.",
            "room" : "126E",
            "speaker" : {
                "web" : "http://www.maungs.com",
                "location" : "Northbrook, IL",
                "name" : "Lwin And Min Maung",
                "bio" : "Lwin Maung is a developer and principal at Accolade Systems, a Chicagoland IT consulting startup. He is a developer of mobile applications. He also secures servers, enable VOIP and SIP solutions, and designs networks for small businesses. In his free time, Lwin plays with microcontrollers. Lwin teamed up with his brother, Min, to win several hackathons. Together, they've developed multiple cross-platform mobile apps. \n\nIn his \"spare\" time, Min Maung is a skilled, cross-platform mobile developer, aggressive hackathon competitor and presenter. Enamored with the Window Phone UI, Min co-created the first Metro UI launcher for Android, featured on Engadget. He's soon to publish \"Accolade Navigator,\" a turn-by-turn, visually compelling GPS navigation system for the Windows Phone 7. When he's not coding, he's building robots. Monday through Friday, you'll find Min at a leading, privately-held payroll and HR sofware solutions company, cranking out .Net code and writing apps in ASP.Net, Silverlight, and other .Net solutions.",
                "img" : "min_lwin_tallsmall.jpg"
            }
        },
        {
            "session" : "Amateur, Pro, or somewhere in between?",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "What's the definition of an amateur? What about a professional? In this session we will discuss the differences between these classifications within the world of sports and how those definitions intersect with those we use in the world of software development and, maybe more interestingly, how they don't.",
            "room" : "132E",
            "speaker" : {
                "web" : "",
                "location" : "Madrid, IA",
                "name" : "Brandon Carlson",
                "bio" : "Brandon is an IT Nerd for Lean TECHniques, a company specializing in Lean and Agile software development and coaching. Brandon has over 15 years of experience in software with experience in both management and development. He is a speaker and on the conference committee for the Agile 20xx series of conferences. In his spare time he likes to read, eat, and sleep.",
                "img" : "brandon-carlson.jpg"
            }
        },
        {
            "session" : "Designing For Your Peers - Part 2",
            "time" : "10:30 AM - 11:45 AM",
            "desc" : "This half day workshop will have participant design a solution based on the needs of their team and other peers. Attendees will be provided an overview of various design topics and then will be asked to work together to develop a solution based on a given scenario. Throughout the process, attendees will go through exercises in brainstorming, persona and mental model development, user interviews, information architecture, and prototyping. This workshop is available to anyone who wants to join though attendees are expected to stay throughout the duration.",
            "room" : "210E",
            "speaker" : {
                "web" : "http://www.jamesreggers.com",
                "location" : "Overland Park, KS",
                "name" : "James Eggers",
                "bio" : "Web designer, developer, and speaker who is always willing to talk about his experiences over his 10+ year career.  An active speaker, he strives to focus on keeping up with the latest industry news and trends while improving or broadening his skills.  Lately, he's focused on a number of different topics including Testable JavaScript, User Experience design, and HTML5.",
                "img" : "james-eggers.jpg"
            }
        },
        {
            "session" : "Lunch",
            "time" : "11:45 AM - 12:45 PM",
            "desc" : "",
            "room" : "",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Win 8 Part 1",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "Jon von Gillern",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Writing Optimized Web Applications with the Google Web Toolkit",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "This session is about structuring web applications with a mind for security, stateless/RESTful behavior, small, chunked downloads, and speedy reaction times, given through the lens of GWT - the Google Web Toolkit. I'll share the strategies I analyzed and implemented in the development of the full-scale web application I've been working on for the 14 months.",
            "room" : "118E",
            "speaker" : {
                "web" : "http://activegrade.com",
                "location" : "Iowa City, IA",
                "name" : "Riley Lark",
                "bio" : "I'm a computer scientist with a passion for education. I worked on several independent programming projects, programmed for the University of Maryland, and interned at Microsoft before leaving the profession to teach high school for five years. Now I'm the programmer for a new ed-software startup, ActiveGrade, based in Iowa City.",
                "img" : "riley.jpg"
            }
        },
        {
            "session" : "Setting up and Using Memcache with NHibernate",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "Setting up and using NHibernate Unit of Work pattern, Membase server, monitoring with NHibernate Profiler, and Membase monitors.",
            "room" : "119E",
            "speaker" : {
                "web" : "",
                "location" : "West Des Moines, IA",
                "name" : "Brandon Weber",
                "bio" : "Software developer at Dwolla. I am mainly a .NET developer who likes to play in Rails. I aspire for world domination. I enjoy reading and tinkering with technology. 6-year Air Force veteran who worked in networking and cryptography. Computer Engineering graduate from Iowa State University with focus on Information Assurance and Network Security. I also enjoy a good rum ham at the beach.",
                "img" : "brandon-weber.jpg"
            }
        },
        {
            "session" : "My love/hate relationship with mobile development",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "Mobile development seems all the rage, but what's the real story behind developing for each of these new platforms? In this session I'll attempt to demystify the different facets of mobile development through the eyes of a c#/java web developer. I'll describe the joys and pitfalls of developing for iPhone/Android/WP7 such as ... initial learning curve of the platform, building layouts, test-driven development, debugging, emulators and may other issues I ran into this past year building real software.",
            "room" : "121E",
            "speaker" : {
                "web" : "http://toranbillups.com",
                "location" : "Des Moines, IA",
                "name" : "Toran Billups",
                "bio" : "Toran Billups is an ex-web developer turned aspiring mobile developer. When he isn't writing c#, java or objective-c you can find him spending time with his family as he attempts the mythical \"work-life balance\"",
                "img" : "toranb.jpg"
            }
        },
        {
            "session" : "What is Clojure?",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "This session will introduce you to the Clojure programming language.\n\nClojure is a new dynamic general-purpose programming language that targets the JVM, CLR, and JavaScript. Clojure is a modern dialect of Lisp and is primarily a functional programming language. Clojure has a rich set of immutable, persistent data structures, and includes strong support for multithreaded programming through software transactional memory and agents.\n\nThere isn't time in a short session like this to actually learn a new language, so we won't even attempt this. Instead, we'll just introduce the language, look at a few code examples, and identify Clojure's strengths and weaknesses.\n\nAt the end of this session, you will know what Clojure is and what it might be good for. And if you decide you want to try it, you will also know how to get started.",
            "room" : "125E",
            "speaker" : {
                "web" : "http://www.bigcreek.com",
                "location" : "Polk City, IA",
                "name" : "David W. Body",
                "bio" : "David W. Body is president of Big Creek Software, LLC, a software consulting firm located in Polk City, Iowa. He is also the founder and leader of the Iowa Ruby Brigade.",
                "img" : "david_reasonably_small.jpg"
            }
        },
        {
            "session" : "F# > C# - What F# does that you can't (easily) do in C#",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "You have heard the arguments. When you get down to it, it is all IL, right? Doesn't that make C# and F# the same? Hogwash!\n\nIn this talk, we will explore those areas where F# has distinct advantages over F#, including:\n\n* Immutability by default\n* Domain on a page\n* Pattern matching\n* Computation expressions\n* The eradication of null\n\nUse what you learn from this talk to be able to, very confidently, make the case for F# to your friends, your colleagues, and greater \"powers-that-be\". Or at least understand why you should stop putting off that nagging \"finally learn F#\" to-do item that has been in the back of your head all these years.",
            "room" : "126E",
            "speaker" : {
                "web" : "http://nomadic-developer.com",
                "location" : "Romeoville, IL",
                "name" : "Aaron Erickson",
                "bio" : "Aaron is a veteran technology consultant, writer, and developer at ThoughtWorks. He is the author of \"The Nomadic Developer\" and most recently a co-author of \"Professional F# 2.0\". His life's work is helping organizations better leverage technology by contributing to solutions that have substantial positive economic impact for his clients. He is an enthusiast of agile software development and continuous delivery. He is also an \"armchair economist\" with lots of unfounded opinions on the topic, a deeply mediocre skier, and has an XBOX 360 GamerScore well approaching 15,000.",
                "img" : "aarone.jpg"
            }
        },
        {
            "session" : "Programming for Reuse",
            "time" : "12:45 PM - 2:00 PM",
            "desc" : "As programmers, we spend more time than we would like to admit programming around the shortcomings of the languages and SDKs we are forced to deal with. The SDKs we use (whether for iOS, Android, Ajax, or server-side) provide as much code as they can, but they can't do everything. And sometimes they have bugs. So we create objects and functions that can be used to patch up these problematic areas.\n\nThis session will go into detail about the type of problems that should be handled with reusable code, how to write objects and functions that are extensible and configurable, and what is required to effectively share this code with other developers. Fundamentals of framework and API design will be discussed. Examples will be used from a number of languages showing the distinct ways they allow us to write reusable code. Base objects from SDKs like iOS and Android will be used examples of how others have approached code reusability and how we can extend these objects.",
            "room" : "132E",
            "speaker" : {
                "web" : "http://bitmethod.com/",
                "location" : "Des Moines, IA",
                "name" : "Neil Roberts",
                "bio" : "Neil is a Dojo master (unrelated to Kung-Fu) and an accomplished programmer, educator, and author. He's recently developed projects for iOS, Android, and the web. Neil freqeuntly runs JavaScript and iOS training programs for enterprise-level development teams, and has taught at Sun's JavaOne Conference.",
                "img" : "neil.jpg"
            }
        },
        {
            "session" : "Break",
            "time" : "2:00 PM - 2:15 PM",
            "desc" : "",
            "room" : "",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Win 8 Part 2",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "Jon von Gillern",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Twenty Ways to Make Your Site Faster (and Easier to Work With) on the Cheap!",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "Scaling websites and making them perform better under load can fall under \"dark magic\" to most but it doesn't have to be that way. Tools and best practices are waiting to be used and followed to make your website scream but few take the time to capture the low hanging fruit. Avoiding the complex and focusing on the simple, this talk will focus on how to make your website scale and be better performant on a limited budget. We'll look at tools such as nginx, memcached, CDNs, Beanstalk as well as some industry best practices that will improve your workflow, how you manage sites, and your user's experience with your site.",
            "room" : "118E",
            "speaker" : {
                "web" : "http://bitmethod.com/",
                "location" : "Des Moines, IA",
                "name" : "Dan Shipton",
                "bio" : "Dan is an established leader of Des Moines’ emerging technology culture – building relationships with events like Ignite Des Moines, Whuffaoke, and the Movement Bash and encouraging others in his support of user groups, tech conferences, hack nights, start-up weekends, and arts events.",
                "img" : "DanShipton-Avatar90x117.jpg"
            }
        },
        {
            "session" : "Graph Databases in Web Applications",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "Data models of many real world problem domains are inherently relational. Relational databases model relations between entities, but traversing these relations can be prohibitively slow due to table joins. In the NoSQL world, key/value and document stores are focused on storing unconnected, denormalized data and typically do not provide good support for relational data. Data in these domains ends up resembling a graph, where the nodes are entities connected together by different types of edges. In graph databases, also part of NoSQL, relations between objects are first-class citizens of the data store. This more closely fits the structure of the domain and speeds up the basic data access required to serve pages in modern web applications. It also opens the door to an advanced set of algorithms based on graph traversals, like search and recommendations. This talk will explore the advantages of using graph databases to store relational data through several compelling example applications using Neo4J, OrientDB, and the TinkerPop stack.",
            "room" : "119E",
            "speaker" : {
                "web" : "http://theza.ch",
                "location" : "Des Moines, IA",
                "name" : "Zach Cox",
                "bio" : "Makes things work. Co-founder & geek at Pongr.",
                "img" : "zach3.jpg"
            }
        },
        {
            "session" : "Experiences with Sencha and PhoneGap",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "Describe my experiences getting a smartphone app to work on iPhone, Android and Blackberry using Sencha and PhoneGap.",
            "room" : "121E",
            "speaker" : {
                "web" : "",
                "location" : "Fairfield, IA",
                "name" : "Ralph Bunker",
                "bio" : "Programming since 1968. Fortran-->BAL360-->PL/I-->C-->C++-->Java-->C#->Javascript",
                "img" : "rbunker.jpg"
            }
        },
        {
            "session" : "How Ruby Is Making Me a Better C# Developer",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "One of the more popular languages today is Ruby, a dynamic language that is focused on programmer happiness and productivity. I've been learning about Ruby at night while I still code C# during the day, and my study of Ruby has had a profound effect on how I approach my .Net projects. This purpose of this session is to demonstrate those effects, including general architecture, testing, data-access, tools, and general philosophy.",
            "room" : "125E",
            "speaker" : {
                "web" : "http://www.github.com/darrencauthon",
                "location" : "Olathe, KS",
                "name" : "Darren Cauthon",
                "bio" : "Darren Cauthon is a programmer who uses C# and ASP.Net MVC to build websites. He is a proponent of TDD, BDD, and SOLID. In his spare time, he studies Ruby, works on OSS projects, and sometimes plays the tuba.",
                "img" : "darren.jpg"
            }
        },
        {
            "session" : "LINQtroduction",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "Language Integrated Query (LINQ, pronounced \"link\") is a Microsoft .NET Framework component that adds native data querying capabilities to .NET languages. Think of LINQ as the SQL you write in your .Net code against almost anything that holds data.\n\nThis presentation will introduce the LINQ syntax and concepts. We will cover LINQ to SQL, LINQ to Objects, Standard Query Operators for LINQ as well as Extension Methods. Developers can return to work tomorrow and start implementing what they learn in VisualStudio 2008 or 2010.",
            "room" : "126E",
            "speaker" : {
                "web" : "http://www.delta3consulting.com",
                "location" : "Altoona, IA",
                "name" : "Dustin Thostenson",
                "bio" : "Dustin Thostenson is an independent .Net consultant, leading Delta 3 Consulting. He has been a developer and trainer in the Des Moines, Iowa area for the last dozen years. His focus has been on Microsoft technologies (ASP, VB, C#) with an emphasis on web development. Experiences span from developer to architecture and mentoring roles. To keep it interesting he teaches a couple of evening classes in programming at Des Moines Area Community College, helps lead the Iowa Dot Net User’s Group and volunteers in Central Iowa. To keep it real he spends time with his wife and 4 kids.",
                "img" : "dustin-thostenson.jpg"
            }
        },
        {
            "session" : "Esoteric Programming Languages",
            "time" : "2:15 PM - 3:30 PM",
            "desc" : "Most of the time we program in modern languages like Ruby or C#. However, there are a plethora of languages out there that are strange, odd, and/or just plain funny. In this talk, I'll go over a number of esoteric programming languages such as Whenever and Befunge. Come with a sense of humor!",
            "room" : "132E",
            "speaker" : {
                "web" : "http://www.jasonbock.net",
                "location" : "Shakopee, MN",
                "name" : "Jason Bock",
                "bio" : "Jason Bock is a Principal Consultant for Magenic (http://www.magenic.com), a Microsoft MVP (C#), and an INETA (http://www.ineta.org) speaker. He has worked on a number of business applications using a diverse set of substrates and languages such as C#, .NET, and Java. He is the author of \"Applied .NET Attributes\", \"CIL Programming: Under the Hood of .NET\", \".NET Security\", and \"Visual Basic 6 Win32 API Tutorial\". He has written numerous articles on software development issues and has presented at a number of conferences and user groups. He is a leader of the Twin Cities Code Camp (http://www.twincitiescodecamp.com) and runs the Twin Cities Languages User Group (http://www.twincitieslanguagesusergroup.com). Jason holds a Master's degree in Electrical Engineering from Marquette University.",
                "img" : "JasonSmallHeadShot.jpg"
            }
        },
        {
            "session" : "Break",
            "time" : "3:30 PM - 3:45 PM",
            "desc" : "",
            "room" : "",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        },
        {
            "session" : "Startup Q&A",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "In this session, we will go through the basics of what it takes to work for yourself. Whether you want to be a solo entrepreneur or start the next Internet wonder, there are some basic steps most companies must take to get off the ground. This session will focus on bootstrapping the small startup, but will contain content that also applies to businesses that plan to raise millions in investment capital. The audience will set the agenda.\n\nScott will share his experience of being an independent software consultant for the past 3 years and what it was like owning a small residential construction company for 8 years. Scott is also a member of a 7 person startup called QONQR, winner of Startup Weekend Twin Cities and finalist at SXSW Accelerator. QONQR is starting their investment funding search, and Scott will share some things they have learned from this process.",
            "room" : "Auditorium",
            "speaker" : {
                "web" : "http://www.ScottKDavis.com",
                "location" : "Minneapolis, MN",
                "name" : "Scott K. Davis",
                "bio" : "Scott is a seasoned consultant with over a decade of consulting experience on both the Microsoft and Java platforms, involving mostly web application development. Scott began working with Silverlight in the 1.1 Alpha, and continues to focus on Silverlight and Windows Phone 7 as his primary developer focus. Scott is also the leader of the Twin Cities Silverlight User Group. Recent projects for Scott include writing Silverlight 4.0, Surface, WinMo6 and WP7 applications, as well as performing executive-level IT strategy and planning consulting. Scott is currently the owner and principal consultant for his consulting firm Ignition Point Solutions, as well as COO of QONQR, a tech startup in the mobile gaming industry.",
                "img" : "scottkdavis.jpg"
            }
        },
        {
            "session" : "Getting Func-y with C# and F#",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "Despite its genesis nearly 60 years ago, functional programming has only recently reemerged as a core technique in mainstream languages. This session will contrast the functional style with imperative and object-oriented programming and dive into real-world examples of how it can be used to solve common problems in C# and F#.",
            "room" : "118E",
            "speaker" : {
                "web" : "http://keith.lostechies.com/",
                "location" : "Cedar Rapids, IA",
                "name" : "Keith Dahlby",
                "bio" : "Keith Dahlby is a new father, .NET developer, language geek and C# MVP from Cedar Rapids, IA. He works as the technical lead at J&P Cycles and blogs about various software development topics with Los Techies. Keith has spoken at community events around the Midwest and studied Human-Computer Interaction at Iowa State University. His talks have been described as \"terrific!\", \"very interactive!\", and \"the best I've seen all hour!\".",
                "img" : "dahlby.jpg"
            }
        },
        {
            "session" : "Intro to CQRS and Event Sourcing",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "CQRS and Event Sourcing is growing in popularity, and for good reason. But is it just a fad? Is it over-architecture? Is it really necessary? In this session, I'll explain what it is, and what it is not. I will also code a real, working example from scratch.",
            "room" : "119E",
            "speaker" : {
                "web" : "http://www.github.com/darrencauthon",
                "location" : "Olathe, KS",
                "name" : "Darren Cauthon",
                "bio" : "Darren Cauthon is a programmer who uses C# and ASP.Net MVC to build websites. He is a proponent of TDD, BDD, and SOLID. In his spare time, he studies Ruby, works on OSS projects, and sometimes plays the tuba.",
                "img" : "darren.jpg"
            }
        },
        {
            "session" : "Push Notifications with Android",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "Push Notifications for Android are a relatively new and very powerful feature. This presentation will explain briefly how they work and then build an app live that implements them.",
            "room" : "121E",
            "speaker" : {
                "web" : "",
                "location" : "Mount Vernon, IA",
                "name" : "Luke Korth",
                "bio" : "Luke Korth is a senior computer science student at Cornell College. He specializes in Web Applications and Computer Security.",
                "img" : "luke-korth.jpg"
            }
        },
        {
            "session" : "Scala Basics",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "An entry level presentation to the object oriented/functional programming hybrid language on the JVM called Scala. Will cover basic theory and syntax on the language and will offer comparisons to existing languages. Will include a brief talk on using functional concepts in Scala. Also will cover the plans for introducing Scala on the .NET framework.",
            "room" : "125E",
            "speaker" : {
                "web" : "",
                "location" : "Des Moines, IA",
                "name" : "Nate Buwalda",
                "bio" : "Is currently a Senior Software Analyst at Iowa Student Loan in Des Moines, IA.  Has been a JVM coder for 8 years.  Has presented at CIJUG and will present at the Iowa Scala Enthusiasts group in October.  Currently is championing the transition from Java to Scala at ISL.",
                "img" : "nate-buwalda.jpg"
            }
        },
        {
            "session" : ".NET Performance Diagnostics - Where to Start",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "Everyone has been plagued by that one page of an application that \"used to work\" that is now running slow as molasses. Well this session is for you, by taking a methodical approach and using the appropriate tools for diagnosis the problem can be solved quickly; and that is what this session is about, a walk through of the processes and tools to get you going!",
            "room" : "126E",
            "speaker" : {
                "web" : "http://www.mitchelsellers.com/blogs.aspx",
                "location" : "Urbandale, IA",
                "name" : "Mitchel Sellers",
                "bio" : "Mitchel Sellers, Microsoft C# MVP, is the CEO of IowaComputerGurus Inc and a regular public speaker and published author on .NET development topics. Mitchel enjoys interacting with the development community sharing information and learning from others. He has placed additional additions and contributions in and around the DotNetNuke Open Source application development platform as well as performance optimization and resolution.",
                "img" : "MitchelSmall.jpg"
            }
        },
        {
            "session" : "Behavior Driven Development from the Trenches",
            "time" : "3:45 PM - 5:00 PM",
            "desc" : "There has been a lot of talk about test-driven, acceptance-test-driven, behavior-driven, anything-you-can-think-of-driven development lately. I will talk about behavior-driven development, how it relates to and encompasses some of these practices. I will show you the tools related to BDD, and how they help you code and design always with the customer's requirements in mind. Then I will actually show you how to get started with BDD on the .Net (specifically C#) platform. You should walk away from this session armed with enough information to get you started towards tested code that really nails what the customer needs.",
            "room" : "132E",
            "speaker" : {
                "web" : "http://disruptivetheory.com/",
                "location" : "Merriam, KS",
                "name" : "Lee Brandt",
                "bio" : "Lee has been programming professionally for more than a decade and currently works as a Project Lead Consultant with AdventureTech. He speaks regionally about software development practices and has mentored teams on improving their approach to lean software development through achieving technical proficiency. He is a Microsoft Most Valuable Professional, one of the leaders of the Kansas City .Net User Group, and serves as the Regional Mentor for .Net user groups in Kansas and Missouri.",
                "img" : "lee_brandt_90x117.jpg"
            }
        },
        {
            "session" : "Closing and Prizes",
            "time" : "5:00 PM - 5:30 PM",
            "desc" : "",
            "room" : "",
            "speaker" : {
                "web" : "",
                "location" : "",
                "name" : "",
                "bio" : "",
                "img" : ""
            }
        }]
    }
}
